bog_app/app/controllers/creatures_controller.rb

  def index
    @creatures = Creature.all
---
SELECT "creatures".* FROM "creatures"

  def create
    creature = Creature.new(creature_params)
    if creature.save
---
INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Dan"], ["description", "Italian"], ["created_at", 2016-12-19 05:23:55 UTC], ["updated_at", 2016-12-19 05:23:55 UTC]]

  def show
    @creature = Creature.find_by(id: params[:id])
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @creature = Creature.find_by(id: params[:id])
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    creature = Creature.find_by(id: params[:id])
    creature.update_attributes(creature_params)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "creatures" SET "name" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["name", "Yolo"], ["updated_at", 2016-12-19 05:31:03 UTC], ["id", 1]]

  def destroy
    Creature.find_by(id: params[:id]).destroy
---
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 4]]
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]